ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_spi.c
/*********************************************************************************************************//**
 * @brief SEL pin is configured to be driven by hardware or software.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_SEL: specify the SPI SEL pin mode.
 *   This parameter can be one of the following values:
 *     @arg SPI_SEL_HARDWARE : SEL is driven by hardware
 *     @arg SPI_SEL_SOFTWARE : SEL is driven by software
 * @retval None
 ************************************************************************************************************/
void SPI_SELModeConfig(HT_SPI_TypeDef* SPIx, u32 SPI_SEL)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_SEL_MODE(SPI_SEL));

  if (SPI_SEL != SPI_SEL_SOFTWARE)
  {
    SPIx->CR1 |= SPI_SEL_HARDWARE;
  }
  else
  {
    SPIx->CR1 &= ~SPI_SEL_HARDWARE;
  }
}

/*********************************************************************************************************//**
 * @brief Configure the SEL state by software.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_SoftwareSEL: specify if the SPI SEL to be active or inactive.
 *   This parameter can be one of the following values:
 *     @arg SPI_SEL_ACTIVE   : activate SEL signal
 *     @arg SPI_SEL_INACTIVE : deactivate SEL signal
 * @retval None
 ************************************************************************************************************/
void SPI_SoftwareSELCmd(HT_SPI_TypeDef* SPIx, u32 SPI_SoftwareSEL)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_SOFTWARE_SEL(SPI_SoftwareSEL));

  if (SPI_SoftwareSEL != SPI_SEL_INACTIVE)
  {
    SPIx->CR0 |= SPI_SEL_ACTIVE;
  }
  else
  {
    /* Inactive SEL pin needs to ensure the transmission has ended. If the program flow cannot guarantee    */
    /* SPI transmission completion, you can enable the procedure below.                                     */
    #if 0
    while (SPIx->SR & SPI_FLAG_BUSY);      /* Wait until SPI NOT BUSY                                       */
    #endif
    SPIx->CR0 &= SPI_SEL_INACTIVE;
  }
}

/*********************************************************************************************************//**
 * @brief Send a data through the SPIx peripheral.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_Data: the data to be transmitted.
 * @retval None
 ************************************************************************************************************/
void SPI_SendData(HT_SPI_TypeDef* SPIx, SPI_DataTypeDef SPI_Data)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_DATA(SPI_Data));

  SPIx->DR = SPI_Data;
}

/*********************************************************************************************************//**
 * @brief Return the received data through the SPIx peripheral
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @retval The value of the received data.
 ************************************************************************************************************/
SPI_DataTypeDef SPI_ReceiveData(HT_SPI_TypeDef* SPIx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));

  return (SPI_DataTypeDef)SPIx->DR;
}

/*********************************************************************************************************//**
 * @brief Set the value of SPI FIFO Time Out.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_Timeout: specify the value of Time Out.
 * @retval None
 ************************************************************************************************************/
void SPI_SetTimeOutValue(HT_SPI_TypeDef* SPIx, SPI_TimeoutTypeDef SPI_Timeout)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));

  SPIx->FTOCR = SPI_Timeout;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified SPI interrupt.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_Int: specify if the SPI interrupt source to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg SPI_INT_TXBE  : SPI Tx buffer empty interrupt
 *     @arg SPI_INT_TXE   : SPI Tx empty interrupt
 *     @arg SPI_INT_RXBNE : SPI Rx buffer not empty interrupt
 *     @arg SPI_INT_WC    : SPI write collision interrupt
 *     @arg SPI_INT_RO    : SPI read overrun interrupt
 *     @arg SPI_INT_MF    : SPI mode fault interrupt
 *     @arg SPI_INT_SA    : SPI slave abort interrupt
 *     @arg SPI_INT_TO    : SPI time out interrupt
 *     @arg SPI_INT_ALL   : All SPI interrupt
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void SPI_IntConfig(HT_SPI_TypeDef* SPIx, u32 SPI_Int, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_SPI(SPIx));
  Assert_Param(IS_SPI_INT(SPI_Int));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    SPIx->IER |= SPI_Int;
  }
  else
  {
    SPIx->IER &= (u32)~SPI_Int;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the specified SPI flag has been set or not.
 * @param SPIx: where SPIx is the selected SPI from the SPI peripherals.
 * @param SPI_Flag: specify the flag that is to be check.
 *   This parameter can be one of the following values:
 *     @arg SPI_FLAG_TXBE  : SPI Tx buffer empty flag
 *     @arg SPI_FLAG_TXE   : SPI Tx empty flag
 *     @arg SPI_FLAG_RXBNE : SPI Rx buffer not empty flag
 *     @arg SPI_FLAG_WC    : SPI write collision flag
 *     @arg SPI_FLAG_RO    : SPI read overrun flag
 *     @arg SPI_FLAG_MF    : SPI mode fault flag
 *     @arg SPI_FLAG_SA    : SPI slave abort flag
 *     @arg SPI_FLAG_TOUT  : SPI time out flag
 *     @arg SPI_FLAG_BUSY  : SPI busy flag
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus SPI_GetFlagStatus(HT_SPI_TypeDef* SPIx, u32 SPI_Flag)
{
  FlagStatus bitstatus = RESET;
  u32 statusreg = 0;

